PANDAS

Pandas Serisi Oluşturmak

In [1]:
import pandas as pd
pd.Series([2,3,4,5,6,8])

0    2
1    3
2    4
3    5
4    6
5    8
dtype: int64

In [2]:
seri = pd.Series([22,34,56,87,908,23])
type(seri)

pandas.core.series.Series

In [3]:
seri.axes

[RangeIndex(start=0, stop=6, step=1)]

In [4]:
seri.ndim

1

In [5]:
seri.values

array([ 22,  34,  56,  87, 908,  23])

In [6]:
seri

0     22
1     34
2     56
3     87
4    908
5     23
dtype: int64

In [7]:
seri.head(2)

0    22
1    34
dtype: int64

In [8]:
seri.tail(3)

3     87
4    908
5     23
dtype: int64

In [24]:
# İNDEX İSİMLENDİRMESİ

seri = pd.Series([22,34,56,87,908,23], index = ["a","b","c","d","e","f"])

In [10]:
seri

a     22
b     34
c     56
d     87
e    908
f     23
dtype: int64

In [11]:
# SÖZLÜK ÜZERİNDEN LİSTE OLUŞTURMAK

sozluk = {"reg":10, "log":11, "cart":12}
sozluk

{'reg': 10, 'log': 11, 'cart': 12}

In [13]:
# İKİ SERİYİ BİRLEŞTİREREK LİSTE OLUŞTURMA

pd.concat([seri,seri])

a     22
b     34
c     56
d     87
e    908
f     23
a     22
b     34
c     56
d     87
e    908
f     23
dtype: int64

Eleman İşlemleri

In [15]:
import numpy as np
a = np.array([154,25,530,49,58,67])
seri = pd.Series(a)
seri

0    154
1     25
2    530
3     49
4     58
5     67
dtype: int64

In [16]:
seri[2:4]

2    530
3     49
dtype: int64

In [18]:
list(seri.items())

[(0, 154), (1, 25), (2, 530), (3, 49), (4, 58), (5, 67)]

In [20]:
# ELEMAN SORGULAMA

"reg" in seri

False

In [ ]:
seri

In [25]:
# FANCY YALAŞIMI İLE ELEMAN SEÇME

seri[["a", "c"]]

a    22
c    56
dtype: int64

In [26]:
seri["a"] = 54

In [27]:
seri["a"]

54

In [28]:
seri["a":"f"]

a     54
b     34
c     56
d     87
e    908
f     23
dtype: int64

Pandas İle DataFrame Oluşturma

In [38]:
import pandas as pd
import numpy as np
a = np.array([[13,24,36],[42,51,64],[75,87,92]])
df = pd.DataFrame(a, columns=["1.sütun","2.sütun","3.sütun"])
df

   1.sütun  2.sütun  3.sütun
0       13       24       36
1       42       51       64
2       75       87       92

In [39]:
# SİLME İŞLEMLERİ

df.drop("1.sütun", axis = 1)

   2.sütun  3.sütun
0       24       36
1       51       64
2       87       92

In [40]:
df

   1.sütun  2.sütun  3.sütun
0       13       24       36
1       42       51       64
2       75       87       92

Gözlem ve Değişken Seçimi (loc & iloc)

In [41]:
# loc: TANIMLANDIĞI ŞEKLİYLE SEÇİM YAPMAK İÇİN KULLANILIR

df.loc[0:3]

   1.sütun  2.sütun  3.sütun
0       13       24       36
1       42       51       64
2       75       87       92

In [42]:
# iloc: ALIŞIK OLDUĞUMUZ İNDEXLEME MANTIĞIYLA SEÇİM YAPAR

df.iloc[0:3]

   1.sütun  2.sütun  3.sütun
0       13       24       36
1       42       51       64
2       75       87       92

Birleştirme (Join) İşlemleri

In [47]:
import pandas as pd
import numpy as np
a = np.array([[13,24,36,56,78],[677,4785,4672,5671,6456],[75,4545,879,87,92]])
df = pd.DataFrame(a, columns=["1.sütun","2.sütun","3.sütun","4.sütun","5.sütun"])
df

   1.sütun  2.sütun  3.sütun  4.sütun  5.sütun
0       13       24       36       56       78
1      677     4785     4672     5671     6456
2       75     4545      879       87       92

In [48]:
import pandas as pd
import numpy as np
a = np.array([[143,254,3346,5566,748],[67567,475485,46572,56471,645236],[752,452345,87349,8734,932]])
df2 = pd.DataFrame(a, columns=["1.sütun","2.sütun","3.sütun","4.sütun","5.sütun"])
df2

   1.sütun  2.sütun  3.sütun  4.sütun  5.sütun
0      143      254     3346     5566      748
1    67567   475485    46572    56471   645236
2      752   452345    87349     8734      932

In [49]:
pd.concat([df,df2])

   1.sütun  2.sütun  3.sütun  4.sütun  5.sütun
0       13       24       36       56       78
1      677     4785     4672     5671     6456
2       75     4545      879       87       92
0      143      254     3346     5566      748
1    67567   475485    46572    56471   645236
2      752   452345    87349     8734      932

In [58]:
pd.concat([df,df2], ignore_index=True)

   1.sütun  2.sütun  3.sütun  4.sütun  5.sütun
0       13       24       36       56       78
1      677     4785     4672     5671     6456
2       75     4545      879       87       92
3      143      254     3346     5566      748
4    67567   475485    46572    56471   645236
5      752   452345    87349     8734      932

İleri Birleştirme İşlemleri

In [109]:
df1 = pd.DataFrame({'calisanlar': ['Caner','Mustafa','Ufuk','Ayse']
                   ,'grup': ['Muhasebe','Muhendislik','Muhendislik','IK']})
df1

  calisanlar         grup
0      Caner     Muhasebe
1    Mustafa  Muhendislik
2       Ufuk  Muhendislik
3       Ayse           IK

In [110]:
df2 = pd.DataFrame({'calisanlar': ['Caner','Mustafa','Ufuk','Ayse'],
                  'ilk_giris' : [2010,2009,2015,2019]})
df2

  calisanlar  ilk_giris
0      Caner       2010
1    Mustafa       2009
2       Ufuk       2015
3       Ayse       2019

In [111]:
# BİREBİR BİRLEŞTİRME

pd.merge(df1,df2)

  calisanlar         grup  ilk_giris
0      Caner     Muhasebe       2010
1    Mustafa  Muhendislik       2009
2       Ufuk  Muhendislik       2015
3       Ayse           IK       2019

In [106]:
df3 = pd.merge(df1,df2)
df3

  calisanlar         grup  ilk_giris
0      Caner     Muhasebe       2010
1    Mustafa  Muhendislik       2009
2       Ufuk  Muhendislik       2015
3       Ayse           IK       2019

In [114]:
df4 = pd.DataFrame({'grup': ['IK','Muhendislik','Muhasebe'],
                  'mudur' : ['Ozan','Merve','Hasan']})
df4

          grup  mudur
0           IK   Ozan
1  Muhendislik  Merve
2     Muhasebe  Hasan

In [115]:
pd.merge(df3,df4)

  calisanlar         grup  ilk_giris  mudur
0      Caner     Muhasebe       2010  Hasan
1    Mustafa  Muhendislik       2009  Merve
2       Ufuk  Muhendislik       2015  Merve
3       Ayse           IK       2019   Ozan

In [119]:
# ÇOKTAN AZA BİRLEŞTİRME
df5 = pd. DataFrame({'grup': ['Muhasebe', 'Muhasebe','Muhendislik', 'Muhendislik', 'IK','IK'],
'yetenekler': ['matematik', 'excel', 'kodlama','linux','excel', 'yonetim']})
df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           IK      excel
5           IK    yonetim

In [120]:
pd.merge(df1,df5)

  calisanlar         grup yetenekler
0      Caner     Muhasebe  matematik
1      Caner     Muhasebe      excel
2    Mustafa  Muhendislik    kodlama
3    Mustafa  Muhendislik      linux
4       Ufuk  Muhendislik    kodlama
5       Ufuk  Muhendislik      linux
6       Ayse           IK      excel
7       Ayse           IK    yonetim

Toplulaştırma ve Gruplandırma

In [2]:
import seaborn as sns
df = sns.load_dataset("planets")